{
  "secondLife": {
    "name": "Second Life Mobiles",
    "short_description": "Second Life Mobiles is an Australian owned and Melbourne operated company providing sustainable products for our customers. At Second Life Mobiles, we sell refurbished smart phones, tablets, and wearables from all the major brands.",
    "description": "Second Life Mobiles is an Australian owned and Melbourne operated company providing sustainable consumer electronics products for our customers. At Second Life Mobiles, we sell refurbished smart phones, tablets, and wearables from all the major brands including Apple, Samsung, and others.  Second Life Mobiles stock a range of used handsets that have been ‘renewed’ - they're all priced really competitively and are 30%-70% cheaper than buying brand new. Every phone we sell has been factory refurbished to the highest possible standard so that it is genuinely 'renewed. You're not just getting a second hand phone - all data has been removed, all features have been reset to factory settings and it has been fully retested. All phones come with a  12 month 'no questions asked' warranty. When you buy a Second Life Mobile you're making a sensible choice for your wallet and the environment.",
    "location": "Melbourne, Australia",
    "seller_since": "On Hulli Since July 2020"
  },
  "mazuma": {
    "name": "Mazuma Mobile",
    "short_description": "Mazuma Mobile is a phone and device reuse specialist based in Victoria, Australia and is part of the EcoRenew Group. We buy and sell 1000s of devices each day and have re-homed millions of devices since 2007.",
    "description": "Welcome to Mazuma Mobile Australia. Thank you for your business. A little about us: Mazuma Mobile is a phone reuse specialist based in Victoria, Australia and is part of the EcoRenew Group. We buy and sell 1000's of devices each day and have re-homed millions of devices since 2007.",
    "location": "Melbourne, Australia",
    "seller_since": "On Hulli Since November 2020"
  },
  "azod": {
    "name": "AZOD Australia",
    "short_description": "Device refurbisher based in Melbourne, Australia",
    "description": "Device refurbisher based in Melbourne, Australia",
    "location": "Melbourne, Australia",
    "seller_since": "On Hulli Since December 2020"
  },
  "becextech": {
    "name": "Becextech",
    "short_description": "BecexTech is a well-established e-tailer and specialises in electronic goods. Since 2006, BecexTech has been providing Australians the best value electronics goods and has helped our local community to save hundreds of thousands of dollars.",
    "description": "BecexTech is a well-established e-tailer and specialises in electronic goods. Since 2006, BecexTech has been providing more than 150,000 Australians the best value electronics goods and help our local community to save hundreds of thousands of dollars their hard-earned cash.  BecexTech carries and stock unlocked Mobile Phones, Smart Phones, PC tablets, Android Tablets, Apple iPads and more from the leading brands such as Apple, Samsung, HTC, ASUS, and the likes. With over 5000+ products to choose from, we surely will feed our customer's hunger for latest technology.  Backed up by 10+ years of experience in the industry, BecexTech strive to provide the highest level of service and consistently strive to exceed our customer’s expectations whilst maintaining our low prices without compromising the quality of our products and services.  We are committed to bring the latest gadgets and electronic goods to local Australians by delivering the best price and best customer’s experience at a matter of click. When people think of buying electronic goods online, they think of BecexTech. ",
    "location": "Melbourne, Australia",
    "seller_since": "On Hulli Since January 2021"
  },
  "oz": {
    "name": "OzMobiles",
    "short_description": "OzMobiles are one of Australia’s leading consumer device refurbishment companies, owned and operated from our Melbourne HQs. We have 20 years experience in dealing with mobile phones, and we love delivering awesome value.",
    "description": "Good for your Pocket, Good for the Planet and Good for You.  OzMobiles are one of Australia’s leading consumer device refurbishment companies, owned and operated from our Melbourne HQs. We have 20 years experience in dealing with mobile phones, and we love delivering awesome value.  Our vision is to provide all Australians with access to the cheapest smartphones, tablets and laptops. We want to provide an amazing experience, one that gives Aussie's the same experience and confidence as if they were buying a brand new phone.  Each device is carefully tested, making sure that we are in compliance with Australian standards and compatible with current Australian networks.",
    "location": "Melbourne, Australia",
    "seller_since": "On Hulli Since March 2021"
  },
  "inl": {
    "name": "Inspiring & Living Pty Ltd",
    "short_description": "Refurbished Mobile Phones on Cheapest Prices.",
    "description": "Inspiring & Living is the cheapest mobile phone shop where you can buy the latest smartphones at a very competitive price. We are Australian-owned, Australian operated and strives over the last 5 years to provide the most up-to-date devices and prices, to our customers. Our main aim to reach out to as many e-shoppers as possible and deliver you an alternative shopping experience with professional customer services where they can buy with peace of mind. We provide tax invoices for all purchases. In addition to sales guarantees, we aim to provide the finest and most professional customer service to every single one of our customers.",
    "location": "Westmead NSW, Australia",
    "seller_since": "On Hulli Since July 2021"
  },
  "phoneCycle": {
    "name": "ReDial",
    "short_description": "",
    "description": "",
    "location": "Doncaster East VIC, Australia",
    "seller_since": "On Hulli Since September 2021"
  },
  "tech4Less": {
    "name": "MV Mobile",
    "short_description": "Your One-Stop Tech Shop",
    "description": "At Mv Mobile, our goal is clear: to become the best Tech Retailer in the country. To do that, we provide an unrivaled selection of the best quality Phones, Tablets, Macbooks and much more with a unique and enjoyable shopping experience, and extraordinary customer service. Our comprehensive warranties, timely shipping, and professional support ensure our customers’ total satisfaction even after their order is complete.",
    "location": "Liverpool NSW, Australia",
    "seller_since": "On Hulli Since September 2021"
  },
  "lyp": {
    "name": "Luvyourphones",
    "short_description": "Refurbished Mobile Devices. Fast Shipping.",
    "description": "Our name says it all, we really do Luv Your Phone! At Luvyourphone.com.au we deliver high-quality mobile devices at competitive prices. We know how important it is for all our customers to have a product that is exceptional in quality and price. Luvyourphone.com.au is a mobile device specialist located in Sydney providing new, demo (as new) and pre-owned refurbished devices. Our focus is on ensuring we supply a large range of mobile phones and accessories to our customers all backed by our 12-month warranty, 7-day customer service support and quality assurance process",
    "location": "Mascot NSW, Australia",
    "seller_since": "On Hulli Since September 2021"
  },
  "deals4Mates": {
    "name": "Deals 4 Mates",
    "short_description": "",
    "description": "",
    "location": "Caboolture South QLD, Australia",
    "seller_since": "On Hulli Since September 2021"
  }
}
